# -*- mode: ruby -*-
tap 'borkdude/brew'
tap 'hashicorp/tap'
tap 'clojure-lsp/brew'

brew 'git'
brew 'mergiraf'
brew 'difftastic'
brew "rlwrap"
brew 'mise'

# tools
brew "zile"
brew "ripgrep"
brew 'jq'
brew 'borkdude/brew/jet'
brew 'gh'
brew 'bat'
brew 'sponge'

cask '1password-cli'

# language specific tooling

brew 'borkdude/brew/clj-kondo'
brew 'clojure-lsp/brew/clojure-lsp-native'

brew 'libvterm'

# psql cli, but without PG itself
brew 'libpq', link: true
brew 'shfmt'

cask 'cyberduck'
brew 'fzf'
cask 'rectangle'
cask 'iterm2'
