tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "aspell"
brew "avro-tools"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "clojure"
brew "jq"
brew "leiningen"
brew "libpq"
brew "mosh"
brew "node@8", link: true
brew "pandoc"
brew "postgresql@9.6"
brew "ruby@2.3"
brew "the_silver_searcher"
brew "tmux"
brew "weechat", args: ["with-aspell", "with-lua", "with-perl", "with-python@2", "with-ruby"]
brew "yarn"
cask "google-cloud-sdk"
cask "adoptopenjdk/openjdk/adoptopenjdk8"
